      *DD0351 24/02/16 anes modif sur correction precedente car le montant n'est pas pris en compte dans le montant pied de facture
      *DD0351 03/02/16 micn on  n'exclu pas l'envoi pour les ligne en Franco domicile avec port
      *DD9999 27/10/15 micn ajout client livre final en cas de transitaire 
      *DD9999 03/09/14 door Ajout du type de prix (fctopx) 
      *DD0351 08/01/14 micn enlever des stat facture 1585006 du 03/01/2013
      *DD9999 19/09/13 door suppression elgu
      *DD0351 07/05/13 micn Differencier les factures normales des gratuits saisie en code 8
      *DD0351 15/04/13 micn facture 7087417
      *DD0351 07/03/13 micn facture 1595145 et 1595143 a enlever du CA + 8006805
      *DD0351 04/03/13 micn facture 2525728 a enlever du CA
      *DD0351 27/02/13 micn facture 7080630 7080631 7080832 7080633 a enlever du CA
      *DD0351 21/03/13 micn facture 1591539 et 1591338 a enlever du C.A.
      *DD0351 21/02/13 micn Facture 1591940 41 et 42 a enlever du C.A.
      *DD0351 18/02/13 micn facture 1583856 a enlever du CA et 7080633
      *DD0351 07/12/12 fach facture 1578425 1578426 15782427 15782428 15782429 1578430 1578431 1578432 1578433 a enlever du CA stat
      *DD0351 16/11/12 micn facture 7068160 et 1573161 a enlever du CA stat
      *DD0351 04/10/12 micn facture 7068160 et 7068162 a enlever du CA stat
      *DD0351 28/09/12 micn facture 1568660 a retirer du C.A.
      *DD0351 07/09/12 micn facture 1554664 a retirer du C.A.
      *DD0351 04/09/12 micn facture 7065747 pour Plasto a retirer du CA
      *DD0351 17/08/12 micn Facture 7063592 pour Plasto
      *DD0351 01/08/12 micn Factures 1557609 pour GPI      
      *DD0351 31/07/12 anes Factures 7063200 pour Plasto
      *DD0351 30/07/12 micn Facture 8004586 pour Oyobrico
      *DD0351 23/07/12 anes fact. 7062404 pour Plasto
      *DD0351 05/07/12 anes start sur sk7 si trt par bornes date
      *DD0351 06/07/12 anes fact. 7060741 et 7060742 a retirer du CA
      *DD0351 18/06/12 micn fact. 7058848 et 7058847 a retirer du C.A. + fact 1550309
      *DD0351 14/06/12 micn Fact. 1542316 1542317 1544688 1541689 a retirer du CA
      *DD0351 01/06/12 micn facture 1547716 et 1547715 a retirer du C.A.
      *DD0351 30/05/12 anes facture 7056583 a retirer du CA
      *DD0351 24/04/12 micn factyre 2449023  a retirer du CA
      *DD0351 19/04/12 micn facture 7054039 + 7054040 a retirer du CA
      *DDE351 17/04/12 micn facture 2455166 + 2455165 + 2455164 a retirer du CA
      *DDE351 06/04/12 micn facture 7052901 a retirer du CA
      *DD0351 04/04/12 micn facture 7052654 a retirer du CA + 1537042
      *DD0351 03/04/12 micn facture 7049816 a retirer du CA 
      *DD0351 13/03/12 micn facture 1527105 a retirer du CA + 7050550 +7050552 +7050553
      *DD0351 12/03/12 fach facture 1526911 a retirer du CA + 7049677 + 7049678
      *DD0351 12/03/12 micn facture 7049312 a retirer du CA
      *DD0351 13/02/12 micn facture 7046953 et 7046950 a retirer du CA
      *DD0351 09/01/12 micn code avoir C908D -> pas maj stat
      *DD0351 06/12/11 micn facture 7041894 7041896 en RFA
      *DD0351 01/12/11 micn facture 7039309 7039311 7039312 7039315 en RFA
      *DD0350 03/11/11 elgu coorection lecture fin de commande en traitement mois
      *DD0503 17/10/11 elgu GERGONNE
      *DD0525 29/09/11 elgu facture 1503695/1503696
      *DD0351 13/09/11 elgu facture 1488679 en RFA
      *DD0351 09/09/11 micn facture 7033794 en RFA
      *DD0351 13/07/11 elgu facture 1487699/1487698 en RFA
      *DD0351 28/06/11 micn mettre facture 7028102 en RFA
      *DD0351 28/06/11 micn mettre facture 7027421 en RFA
      *DD0351 16/06/11 elgu mettre facture 1481288 en RFA
      *DD0351 06/06/11 elgu nouveau code avoir C908R
      *DD0459 19/04/11 elgu nouvelle zone infocom
      *DD0221 18/03/11 elgu ne plus charger la reference commnade client dans fcomjoc1
      *DD0351 01/03/11 elgu ajout nouvelles factures de rfa pour plasto
      *                     pour extraction mensuelle parametrer la date
      *                     idem facture RFA pour GPI
      *DD0351 03/01/11 elgu pour plasto: 3 factures a passer en stat RFA (2)
      *DD0351 20/12/10 elgu je passe la reference commande client a 12 caractere dans fcommac1
      *DD0465 13/08/10 elgu modif pour Plasto et correction recherche reference commande client 
      *DD0351 05/07/10 elgu facture a ventiler en RFA
      *DD0351 12/04/10 elgu ajout grande classe de la reference
      *DD0351 09/03/10 elgu facture a ventiler en RFA 
      *DD0351 15/02/10 micn ajout de la date d'echeance de la commande facturee
      *DD0351 11/02/10 elgu mise cetains avoir NESPOLI et DELOS sur stat 2009
      *DD0351 14/01/10 elgu pour facture ooutillage on force le niveau de la ref a devis (00)la ref
      *DD0351 07/01/10 elgu ajout d'une nouvelles cause avoir
      *DD0298 17/11/09 elgu modif pour cdesup
      *DD0351 15/10/09 elgu 3 factures de RFA pour CORA a gerer manuellement
      *DD0350 01/07/09 elgu differentier les stats port et rfa
      *DD0351 29/12/08 elgu suite a traitement fin annee Slovaquie facturation au 29/12/08 des commandes oubliees avec ca dans les bons mois pour les stats
      *DD0351 03/12/08 elgu suite pb remise non effectuee sur facture gpi ==> erels changement date de facture/avoir
      *DD0351 13/10/08 elgu pour gpi ne pas letre en stat la facture 1301986 : complement de la facture 1298303
      *                     sur laquelle une remise de 10% a ete applique sur toutes les commandes regroupees de la facture
      *                     suite a un bug dans le programme cglp-fact1 et remise SP
      *DD0221 29/09/08 elgu modif reference client pour PLanit/BriKodepot/lapeyre idem Bricorama
      *DD0351 22/08/08 elgu modifs pour refacturation erels
      *DD0350 24/06/08 elgu prendre les lignes montant a zero
      *DD0351 02/04/08 elgu modif date avoir 1268514 de GPI a DINAC pour facturation en trop sur 2007
      *DD0394 10/03/08 elgu modif des dates pour ventiler les factures de cession dans les bons mois
      *DD0351 08/02/08 elgu modif de la destination du fichier pour la dataware
      *                     et suppression des closes de fichier car plantage cgcd-pre2 sur fcommac4
      *DD0351 16/01/08 elgu pour montant pied de facture ne pas convertir car deja dans la devise euro
      *DD0350 24/10/07 elgu correction conversion des montants dans la devise de base
      *                     le montant pied de facture etait converti 2 fois
      *DD0279 25/09/07 elgu ajout traitement une commande passee en parametre et direct 3
      *DD0351 27/07/07 elgu ajout pcb + modif conversion devise avec taux facture
      *DD0351 04/06/07 elgu
      *DD0350 03/04/07 elgu correction niveau wdop3
      *DD0350 19/01/07 elgu correction recherche date expedition manquait indice reliquat
      *DD0351 16/01/07 elgu correction montant remise signe non teste
      *DD0351 11/12/06 elgu ajout code gestion du livrea,type de cde,code port et code plateforme
      *DD0351 04/12/06 elgu modification forma des champs date et montant pour integration direct
      *                     dans data ware
      *                     + ajout pays et code postal livre pour gestion transport par web
      *DD0351 29/11/06 elgu pour traitement mensuel lecture pieds de facture sur date facture
      *DD0279 20/11/06 elgu ajout livrea et poids de la commande et ref cde client
      *DD0324 08/08/06 elgu
      *DD0326 21/06/06 elgu
      *DD9999 20/06/06 elgu remplace depot livre par lieu expedition
      *DD0316 01/05/06 elgu
      *DD0316 24/04/06 micn correct fccle2
      *DD0314 10/04/06 elgu ne pas prendre le pied de facture pour LEAU si date
      *                     facture au 31/03/06 car pied GPI
      *DD0298 06/03/06 elgu ajout ref commande mere pour allotie fille
      *DD9999 01/12/05 elgu controle existence facture si numero # zero
      *DD0153 24/10/05 elgu ahout zones pour integration dataware
      *DD9999 elgu le 05/11/03 prendre systematiquement le representant
      *       de la commande car si une seule facture pour n cdes le repesentant
      *       du pied de facture est aleatoire
      *DD0011 12/03/03 elgu
       IDENTIFICATION DIVISION.
       PROGRAM-ID. cmex-stat1.
      *
      * GPICMT     EXTRACTION LIGNES FACTUREES pour stat jlro
      *                  POUR UNE PERIODE DONNEE
      *
      *DDE999 06/01/03 elgu  ne pas prendre les pro formats
      *DDE236 23/09/02 elgu ajout infocom
      *DDE153
      *DDE004
      *
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. DPS-4.
       OBJECT-COMPUTER. DPS-4.
       INPUT-OUTPUT SECTION.
      *
       DATA DIVISION.
      *
       WORKING-STORAGE SECTION.
           copy "/usr/action/ADL/copy/wor-adl".
DD0279     copy "../copy/wor-fcommac1".                                 *GPICMT
           copy "../copy/wor-fcommaap".                                 *GPICMT
           copy "../copy/wor-fcommac2".                                 *GPICMT
           copy "../copy/wor-fcommac4".                                 *GPICMT
           copy "../copy/wor-ffacture".                                 *GPICMT
           copy "../copy/wor-avoircli".                                 *GPICMT
           copy "../copy/wor-seqbidon".                                 *GPICMT
           copy "../copy/mmti-date.com".                                *GPICMT
           copy "../copy/cmexstat.com".                                 *GPICMT
           copy '../copy/mmca-devi.com'.                                *GPICMT
      * zones interfaces recherches remises globales                    *GPICMT
           copy '../copy/cmta-comi.com'.                                *GPICMT
           copy '../copy/cgca-mtht.com'.                                *GPICMT
           copy "../copy/mmaf-vali.com".                                *GPICMT
DDE236     copy "../copy/cmre-infc.com".                                *GPICMT
DD0011     copy "../copy/mmut-mail.com".                                *GPICMT
DD0011     copy "../copy/mmca-date.com".                                *GPICMT
DD0153     copy "../copy/cmcd-gest.com".                                *GPICMT
DD0153     copy "../copy/cmcd-etat.com".                                *GPICMT
DD0153     copy '../copy/cged-avis.com'.                                *GPICMT
DD0153     copy '../copy/mmca-alph.com'.                                *GPICMT
DD0153     copy '../copy/mmre-nire.com'.                                *GPICMT
DD0298     copy '../copy/cmpa-tycd.com'.                                *GPICMT
DD0298     copy '../copy/cgcd-mere.com'.                                *GPICMT
DD9999     copy "../copy/mmdt-lieu.com".
DD0279     copy "../copy/cmcd-ware.com".
DD0279     copy '../copy/mmpa-fich.com'.                                *GPICMT

       01  TOUT.
      * nom pgm pour vali1
           02  wnom-prog                PIC X(10) value 'cmex-stat1'.
DD0351* memo grande classe reference par defaut
           02 wtgc                      pic x.
DD0279     02  var-name                 PIC X(80).
  -        02  var-data                 PIC X(80).
  -        02 sys-var                   PIC X(500).
  -        02 syst-rtn                  PIC s9(4)  comp.
  -        02 wgpitmp                   pic x(20).
DD0279   02  wadlpid                    pic x(8).
DD0351* montant pour calcul ligne montant remise
           02   wmontant          pic s9(10)v99.
DD0279** LIBELLE REFERENCE COMMANDE DU CLIENT POUR BRICORAMA            *GPICMT
           02   WLENTB.                                                 *GPICMT
            03  WLAB              PIC X(18).                            *GPICMT
            03  WLBB              pic x(12).                            *GPICMT

DD9999* flag erreur
           02 werr         pic 9.
      * description enreg reference gpi pour outillage
           02 wdopx.
             03 wdop1           pic x(16).
             03 wdop2x.
              04 wdop2          pic 9(7).
              04 filler         pic x.
             03 wdop3           pic 99.

      * code article par type
           02 wcodx.
             03 wport          pic x(7) value '9990041'.
             03 waff           pic x(7) value '9990042'.
             03 wmajo          pic x(7) value '9990164'.
             03 wouti          pic x(7) value '9990107'.
           02 wcod redefines wcodx pic x(7) occurs 2.
           02 wi               pic 9.
           02 wentree.
      * types de frais a traiter
      * 1=port/affranchissement,2=majo
             03 wtypex.
               04 wtype occurs 3 pic x.
      *
           02 wautre           pic x.
           02 wprem            pic x.
           02 wpremc           pic x.
      *montant pied de facture
           02 w-fbnmf          pic 9(8)v99.
      * cause avoir
           02 w-info           pic x(10).
      *Fact. 1542316 1542317 1544688 1541689 a retirer du CA zone de calcul
           02         MAN1      PIC 9(9)V99.
DD0011* numero de facture utilise
DD0316     02 wfbcle-cdesup    pic 9(7).
DD0314* date facture
           02 wfbdate.
              03 wfbdfa        pic 9(2).
              03 wfbdfm        pic 9(2).

DD0351* Flag traitement par date si passee en parametre
           02 wflag-sk7        pic x value "0".

DD0351* Montant de port pour traitement particulier
  |        02 wmont-port       pic s9(6)v99.
DD0351     02 wcmexstat-montpf pic s9(9)v99.
      *

DD0011 linkage section.
DD0011     copy '../copy/cmex-stat.com'.

DD0011 PROCEDURE DIVISION using cmex-stat adl-art.
      *
       PREM SECTION.
       T00.

DD0279     move spaces to ocmex-stat-liberr
DD0279     move cmmdt-envi-rtn-ok to ocmex-stat-rtn
DD9999     move zero to werr
           move '0' to wprem

DD0011     move 'D' to immti-date-taj
DD0011     call 'mmti-date1' using mmti-date adl-art

GPICMT   if wcmex-stat-e1action not = ccmex-stat-e1action-cdex
           move 'O' to gfkey
           perform op-seqbidon
         else

      * On RAZ le fichier edition
           move 'I' to immpa-fich-trt
           call 'mmpa-fich1' using mmpa-fich adl-art
           move icmex-stat-cdex to fccle-cdesup
           perform r-fcommaap
           go to lec-cde
         end-if

DD0351* anes 05/07/2012 : si on traite par periode...
  |   *      il faudra faire un start sur la cle sk7 de fcommaap
DD0351     if wcmex-stat-e1action = "P" 
              move "1" to wflag-sk7 
           end-if

DD0011* si periode mensuelle demande saisie periode sinon recup periode passee
      * par l'interface si non renseignee on prend la date du jour comme date
      * fin et on calcule la date debut par rapport au nbre de mois passe
DD0153* GPICMT pour traitement data ware on passe l'encours total commande
DD0153* GPICMT et les factures du mois precedent et en cours periode = "W"
           if wcmex-stat-e1periode = 'J' or wcmex-stat-e1periode = 'W'
              if (wcmex-stat-e1datdeb = spaces or = zero) and
                 (wcmex-stat-e1datfin = spaces or = zero)
                 move wmmti-date-jma to wcmex-stat-e1datdeb
                                        wcmex-stat-e1datfin
                 move wcmex-stat-e1datdeb to immca-date-jma
                 move 's'                 to immca-date-trt
                 move wcmex-stat-e1nbm    to immca-date-nbj
                 call 'mmca-date1' using mmca-date adl-art
                 if ommca-date-rtn = cmmdt-envi-rtn-ok
                    move ommca-date-jma to wcmex-stat-e1datdeb
                    move 1 to wcmex-stat-e1jd
                 end-if
                 go to debut-cde
              else
                 go to t11
              end-if
           end-if
           if wcmex-stat-e1datdeb not = spaces and not = zero
              go to debut-cde
           end-if
           .
       t10.
           move spaces to wcmex-stat-e1datdeb.
           display 'Extraction des stats pour fichier excel'.
           display "DATE DEBUT: JJMMAA, F=FIN".
           accept wcmex-stat-e1datdeb.
           if wcmex-stat-e1datdeb = "F" or wcmex-stat-e1datdeb = "f"
              go to fin
           end-if
           move spaces to wcmex-stat-e1datfin.
           display "DATE FIN: JJMMAA, F=FIN".
           accept wcmex-stat-e1datfin.
           if wcmex-stat-e1datfin = "F" or wcmex-stat-e1datfin = "f"
              go to fin
           end-if
           .
DD0011 t11.
           move wcmex-stat-e1jd to immti-date-dajour
           move wcmex-stat-e1md to immti-date-damois
           move wcmex-stat-e1ad to immti-date-daanne
           move wcmex-stat-e1jf to immti-date-fajour
           move wcmex-stat-e1mf to immti-date-famois
           move wcmex-stat-e1af to immti-date-faanne
           move '<=' to immti-date-trt
           perform ctrl-date
           if ommti-date-rtn not = '0'
DD0351        move "0" to wflag-sk7
              string 'Date invalide ' wcmex-stat-e1datdeb ' '
                                      wcmex-stat-e1datfin
                     ' ' ommti-date-liberr
                 delimited size into immaf-vali-tit
              perform erreur
DD0153        if wcmex-stat-e1periode = 'J' or
DD0153           wcmex-stat-e1periode = 'W'
                 move immaf-vali-tit to ocmex-stat-liberr
                 move cmmdt-envi-rtn-err to ocmex-stat-rtn
                 go to fin
              end-if
              go to t10
           end-if
           .

       debut-cde.
DDE153* lecture commande sur cle numero de facture car plusieurs possibles
      * pour une facture
      *    move fbncd to fccle
      *    perform rnl-fcommaap
           move spaces to fccle-cdesup
DD0316     move zero to fcnfa-cdesup wfbcle-cdesup
DD0351* anes 05/07/2012
  |        if wflag-sk7 = "1"
  |           move wcmex-stat-e1ad to fcann
  |           move wcmex-stat-e1md to fcmoi
  |           move wcmex-stat-e1jd to fcjou
  |           initialize fcncl
DD0351     end-if
DD0011* trt mensuel on fait une start sur la cle 2(date facture/num facture)
           if wcmex-stat-e1periode = 'M'
DD0351        go to lec-facture-start
           end-if
           .
DD0351 lec-cde-start.
DD0351* anes 05/07/2012
DD0351     if wflag-sk7 = "1"
  |           perform snlsk7-fcommaap
DD0351     else
              perform snlsk4-fcommaap
DD0351     end-if
           if file-status = zero
              perform nnl-fcommaap
           end-if
           .
DDE153 lec-cde.
DD0351*anes 24/02/16 traitement du montant du port 
DD0351     initialize wmont-port
           if file-status not = zero
DD0350*       go to fin
DD0350        if wcmex-stat-e1periode = 'M'                             *GPICMT
  -              go to lec-facture-suite                                *GPICMT
  -           else                                                      *GPICMT
  -              go to fin                                              *GPICMT
DD0350        end-if
           end-if

GPICMT* si traitement mensuel et rupture facture on passe a la facture suivante
DD0350     if wcmex-stat-e1periode = 'M'                                *GPICMT
  -           and fcnfa-cdesup not = fbcle-cdesup                       *GPICMT
  -           go to lec-facture-suite                                   *GPICMT
DD0350     end-if

DDE999* on ne prend pas les pro format
           if fcfoa = 9
DD0279        if wcmex-stat-e1action = ccmex-stat-e1action-cdex
  -              string "Commande " icmex-stat-cdex
  -                     " Proforma ==> non traitee"
  -                     delimited size into ocmex-stat-liberr
  -              move cmmdt-envi-rtn-err to ocmex-stat-rtn
DD0279        end-if
              go to fin-fact
           end-if

GPICMT* appel gestion des types de commandes pour controle trt en stat
DD0298     initialize wcmpa-tycd                                        *GPICMT
  "        move fcfeo to wcmpa-tycd-typ                                 *GPICMT
  "        move ccmpa-tycd-gestion-tycd to icmpa-tycd-gestion           *GPICMT
  "        call 'cmpa-tycd1' using cmpa-tycd adl-art                    *GPICMT
  "        if ocmpa-tycd-stat = cmmdt-envi-rtn-faux
DD0279        if wcmex-stat-e1action = ccmex-stat-e1action-cdex
  -              string "Commande " icmex-stat-cdex
  -                  " Type ==> non traitee"
  -                     delimited size into ocmex-stat-liberr
  -              move cmmdt-envi-rtn-err to ocmex-stat-rtn
DD0279        end-if
  "           go to fin-fact
DD0298     end-if

GPICMT* recherche etat de la commande
DD0153     move ccmcd-etat-trt-r to icmcd-etat-trt
DD0316     move fccle-cdesup to wcmcd-etat-cdex-cdesup
           call 'cmcd-etat1' using cmcd-etat adl-art
GPICMT* recherche groupement du commande par
DD0316     move fccle-cdesup to icmcd-gest-numcde
           call "cmcd-gest1" using cmcd-gest adl-art

DD0011* pour trt mensuel si numero facture a zero ==> cde non facturee
DD0316     if fcnfa-cdesup = zero
DD0316        move zero to wfbcle-cdesup
              go to ctrl-cde
           end-if

DD0350     if wcmex-stat-e1periode = 'M'                                *GPICMT
  -           go to ctrl-cde                                            *GPICMT
DD0350     end-if

           .
      *
      *****  lecture facture correspondante
       lec-fact.
DD0316     move fcnfa-cdesup to fbcle-cdesup wfbcle-cdesup
DD031   IF fcnfa-cdesup not = zero
           perform rnl-ffacture
           IF file-status = zero
GPICMT* pour LEAU on teste la date de facture si < 31/03/06 on ne traite pas
DD0314        if mmdt-societe = "LEAU"
  "              move fbdfm to wfbdfm
  "              move fbdfa to wfbdfa
  "              if wfbdate < 0604
  "                 display 'Facture ' fbcle-cdesup
                            ' Inexistante,Cde ' fccle-cdesup
GPICMT* en cas d'erreur on ne demande pas de reponse en traitement journalier
  "                 perform err-fin
  "                 go to fin-fact
  "              end-if
DD0314        end-if

DD0011* si trt mensuel on ne prend que les factures passee en compta
      * de la periode demandee
              if fbjvt  not = 1
DD0316           move zero to wfbcle-cdesup
              else
DD0153*GPICMT traitement data ware ==> controle date facture
DD0153*GPICMT pour les factures passees en comptabilite
GPICMT           if wcmex-stat-e1periode = 'W'
      * controle date debut date facture > ou = date debut
                    move fbdfj to immti-date-dajour
                    move fbdfm to immti-date-damois
                    move fbdfa to immti-date-daanne
                    move wcmex-stat-e1jd   to immti-date-fajour
                    move wcmex-stat-e1md   to immti-date-famois
                    move wcmex-stat-e1ad   to immti-date-faanne
                    move ">=" to immti-date-trt
                    perform ctrl-date
                    if ommti-date-rtn not = '0'
                       go to fin-fact
                    end-if
      * controle date fin date facture < ou = date fin
                    move fbdfj to immti-date-dajour
                    move fbdfm to immti-date-damois
                    move fbdfa to immti-date-daanne
                    move wcmex-stat-e1jf   to immti-date-fajour
                    move wcmex-stat-e1mf   to immti-date-famois
                    move wcmex-stat-e1af   to immti-date-faanne
                    move "<="  to immti-date-trt
                    perform ctrl-date
                    if ommti-date-rtn not = '0'
                       go to fin-fact
                    end-if
                    go to trt-fact
                 end-if
              end-if
DD9999     else
  "           display 'Facture ' fcnfa-cdesup ' Inex.,Cde ' fccle-cdesup
GPICMT* en cas d'erreur on ne demande pas de reponse en traitement journalier
  "           perform err-fin
  "           go to fin-fact
  "        end-if
DD9999   END-IF
           .
       ctrl-cde.

DD0153*GPICMT controle date de commande pour traitement journalier
      * controle date commande date facture > ou = date debut           *GPICMT
GPICMT   if wcmex-stat-e1periode = 'J'
           move fcjou to immti-date-dajour
           move fcmoi to immti-date-damois
           move fcann to immti-date-daanne
           move wcmex-stat-e1jd   to immti-date-fajour
           move wcmex-stat-e1md   to immti-date-famois
           move wcmex-stat-e1ad   to immti-date-faanne
           move ">=" to immti-date-trt
           perform ctrl-date
           if ommti-date-rtn not = '0'
              go to fin-fact
           end-if
      * controle date fin date facture < ou = date fin
           move fcjou to immti-date-dajour
           move fcmoi to immti-date-damois
           move fcann to immti-date-daanne
           move wcmex-stat-e1jf   to immti-date-fajour
           move wcmex-stat-e1mf   to immti-date-famois
           move wcmex-stat-e1af   to immti-date-faanne
           move "<="  to immti-date-trt
           perform ctrl-date
           if ommti-date-rtn not = '0'
DD0351* anes 05/07/2012 : si trt par bornes date (sk7), sortie du trt 
DD0351        if wflag-sk7 = "1" 
                 move "F" to wflag-sk7 
              end-if
              go to fin-fact
           end-if
DD0153   end-if
           .
       trt-fact.

      * conversion net marchandise facture en devise stat en compta
      * on est en euro
           move 62 to weu-adev
           move 99    to weu-ndev
DD0316     if wfbcle-cdesup not = zero
              move FBNMF  to w-fbnmf
           else
              move fcmht to weu-pht
DD0351        move fcdev to weu-adev
DD0351        move spaces to weu-trt
GPICMT* si commande facturee on prend le taux dans le pied de facture
DD0350        perform taux
              call 'mmca-devi1' using wmmca-devi adl-art
              if weu-err = spaces
                 move weu-pht to w-fbnmf
              end-if
           end-if


      * si avoir  lecture de AVOIRCLI pour recuperer la cause avoir
DD0316     IF fcfoa = 5 or = 6 or = 7 and wfbcle-cdesup not = zero
DD0316        move fccle-cdesup to avcle
              perform rnl-avoircli
              if file-status = zero
                 move avcod to w-info
              else
                 move spaces to w-info
              end-if
           END-IF

      * appel fonction de recherche des remises globales
DD0316     move fccle-cdesup to wcmta-comi-ncd
           call "cmta-comi3" using wcmta-comi adl-art.

GPICMT* si commande allotie on recherche la commande mere
DD0298     move cmmdt-envi-rtn-faux to ocgcd-mere-rtn
DD0298     if fcfeo = ccmpa-tycd-typ-allotie-fille(1:1)
  "           move fccle-cdesup to icgcd-mere-numcdex-fille
  "           move ccgcd-mere-e1trt-mere to wcgcd-mere-e1trt
  "           call "cgcd-mere1" using cgcd-mere adl-art
DD0298     end-if

           .
      * trt des lignes articles
       lec-ligne.
GPICMT* initialisation grande classe article avec le 1er car du code tarif
DD0351     move fctve(1:1) to wtgc
DD0316     move zeroes to fccle2-cdesup fcnel2
DD0316     move fccle-cdesup  to fcnoc2-cdesup.
           move 04     to fcnel2.
           move zeroes to fcunix2.
           perform snl-fcommac2.
           if file-status not = zero
              GO TO lec-lmont
           end-if
           .
       lec-ligne-s.
           perform nnl-fcommac2.
           if file-status not = zero
              GO TO lec-lmont
           end-if
DD0316     if fcnoc2-cdesup not = fccle-cdesup
              go to lec-lmont
           end-if

      *DDE236 recherche infocom
DD0316     move fcnoc2-cdesup to cf7-noc
           move fcnlg  to cf7-nlg
           move ccmre-infc-trt-portefeuille to icmre-infc-trt
           call 'cmre-infc1' using cmre-infc adl-art

      *       remplacer calcul du montant ligne par une fonction car
      *       le calcul etait different de celui de la facture d'ou erreur
      *       en stat (erreur arrondi pour boites incomplete)

      *       remplacement calcul montant ligne par une fonction
DD0316     if wfbcle-cdesup not = zero
              move fcqtl to tcgca-mtht-qte
           else
              if fcliv = zero
                 move fcqtc to tcgca-mtht-qte
              else
                 move fcqtl to tcgca-mtht-qte
              end-if
           end-if
           move fcqpb  to tcgca-mtht-qpb
           move fcmes  to tcgca-mtht-mes
           move fcprx  to tcgca-mtht-prx
           move fcpht   to tcgca-mtht-pht
           call 'cgca-mtht2' using cgca-mtht adl-art
           move tcgca-mtht-htl to man1.

      *
      * si remises globales detectees par cmta-comi3 ==> appel cmta-comi5 pour
      * calculer le montant reel a passer en stat (remise deduite)
           IF wcmta-comi-remx not = spaces
              move fcnar to wcmta-comi-narx
              move fcsre to wcmta-comi-nsrx
              move man1  to wcmta-comi-resu
              call "cmta-comi5" using wcmta-comi adl-art
              if wcmta-comi-rtn = "0"
                 move wcmta-comi-resu to man1
              end-if
           END-IF

GPICMT* chargement grande classe ligne article
           if fctgc not = zero and not = space
              move fctgc to wtgc
           end-if

           perform init-enreg
           move fcnarx to cmexstat-ref
           move fcsrex to cmexstat-sref
DD9999* DOOR 03/09/2014 ajout du type de prix
DD9999     move fctopx to cmexstat-type-prix
DD0153*GPICMT recherche niveau de l'article
DD0153     perform rech-niv
DD0351* traitement avoir ou facture
  -        if fcfoa < 4
              move man1 to cmexstat-mont
              move fcqtc to cmexstat-qtc
              move fcqtl to cmexstat-qtl
           else
              multiply man1 by -1 giving cmexstat-mont
              multiply fcqtc by -1 giving cmexstat-qtc
              multiply fcqtl by -1 giving cmexstat-qtl
           end-if
GPICMT* pour les factures comptables ou avoir comptable (sans livraison physique de marchandise)
GPICMT* on met a zero la quantite livree
DD0351     if fcfoa = "2" or fcfoa = "7"
  -           move zero to cmexstat-qtl cmexstat-qtc
DD0351     end-if
DD0459     if fcinfocom not = spaces
              string fcinfocom fcannexe
                     delimited size into cmexstat-infocom
           else
              move wcmre-infc-infc to cmexstat-infocom
           end-if
DD0153* numero de la ligne de commande
DD0153     move fcnlg to cmexstat-ligne

DD0351     if fcqpb > zero
  "           move fcqpb to  cmexstat-pcb
DD0351     end-if

           perform ecrit
           go to lec-ligne-s
           .

       lec-lmont.
DD0316     move zeroes to fccle4-cdesup.
           move 05     to fcnel4.
DD0316     move fccle-cdesup to fcnoc4-cdesup.
           move zeroes to fcunix4.
           move '0' to wpremc.
           perform snl-fcommac4.
           if file-status not = zero
              GO TO fin-fact
           end-if
           .
       lec-lmont-s.
           perform nnl-fcommac4.
           if file-status not = zero
              GO TO fin-fact
           end-if
DD0316     if fcnoc4-cdesup not = fccle-cdesup
              go to fin-fact
           end-if
GPICMT* on ne traite pas les elements port et affranchissement qui seront pris
GPICMT* directement a partir du pied de facture ni les elemnts remises dont on
GPICMT* tient compte dns le calcul des montants lignes par article
GPICMT*DDE153 on ne peut plus prendre le port dans le pied de facture car
GPICMT*       il est egal au cumul de port de plusieurs commandes dans le cas
GPICMT*       d' un regroupement de commande sur une meme facture
DDE153*    if fcnel4 = 6 or = 7 or = 8
DDE153     if fcnel4 = 7
GPICMT        go to lec-lmont-s
           end-if

DDE153     if fcnel4 = 6 or = 8
              perform trt-port
              go to lec-lmont-s
           end-if

           if fcnel4 > 9
              go to fin-fact
           end-if
           if fcdop = "H.T. INSUFFISANT : MAJORATION"
              go to trt-majo
           end-if
           if fcfeo = 1 or = 2 or = 4 or = 5 and wpremc = '0'
              go to trt-outi
           end-if
DD0350*    if fcmon = zero
  -   *       go to lec-lmont-s
DD0350*    end-if
           perform init-enreg
DD0153* numero de ligne de commande
DD0153     string fcnel4(2:1) fcunix4
                   delimited size into cmexstat-ligne
DD0351* traitement avoir ou facture
  -        if fcfoa < 4
              move fcmon to wmontant
           else
              multiply fcmon by -1 giving wmontant
           end-if

GPICMT* la zone peut-etre signee
DD0351     if fcsig = '-'
  -           multiply wmontant by -1 giving cmexstat-mont
  -        else
  -           move wmontant to cmexstat-mont
DD0351     end-if

      *
      * si montant ligne saisi (ex: retour marchandise) on eleve les remises
      * si remises globales detectees par cmta-comi3 ==> appel cmta-comi5 pour
      * calculer le montant reel a passer en stat (remise deduite)
           IF fcnel4 = 5
              if wcmta-comi-remx not = spaces
                 move spaces to wcmta-comi-narx
                 move spaces to wcmta-comi-nsrx
                 move fcmon  to wcmta-comi-resu
                 call "cmta-comi5" using wcmta-comi adl-art
                 if wcmta-comi-rtn = "0"
DD0351* traitement avoir ou facture
  -                if fcfoa < 4
                     move wcmta-comi-resu to wmontant
                   else
                     multiply wcmta-comi-resu by -1 giving wmontant
                   end-if
GPICMT* la zone peut-etre signee
DD0351             if fcsig = '-'
  -                   multiply wmontant by -1 giving cmexstat-mont
  -                else
  -                   move wmontant to cmexstat-mont
DD0351             end-if
                 end-if
              end-if
           END-IF

           move fcdop to cmexstat-ldivers
           move 'DIVERS' to cmexstat-ref.
           perform ecrit
           go to lec-lmont-s.
       trt-majo.
           move 2 to wi
           go to trt-creat.
       trt-outi.
           move '1' to wpremc
DD0351*    if fcmon = zero
  -   *       go to lec-lmont-s
DD0351*    end-if
           perform init-enreg
DD0153* numero de ligne de commande
DD0153     string fcnel4(2:1) fcunix4
                   delimited size into cmexstat-ligne
DD0351* traitement avoir ou facture
  -        if fcfoa < 4
              move fcmon to cmexstat-mont
           else
              multiply fcmon by -1 giving cmexstat-mont
           end-if
           move wouti to cmexstat-ref.
       trt-outi-s.
           perform nnl-fcommac4.
DD0316*    if file-status not = zero or fcnoc4 not = fccle or
DD0316     if file-status not = zero or fcnoc4-cdesup not = fccle-cdesup
                   or fcnel4 > 9
              perform ecrit
              go to lec-lmont-s
           end-if
           move fcdop to wdopx.
           if wdop1 not = "REFERENCE GPI :"
              go to trt-outi-s
           end-if
           move wdop2 to cmexstat-ref
           move wdop3 to cmexstat-sref
GPICMT* on force le niveau devis
           move "00" to cmexstat-niv
           perform ecrit
           go to lec-lmont-s.

       trt-creat.
           perform init-enreg
DD0153* numero de ligne de commande
DD0153     string fcnel4(2:1) fcunix4
                   delimited size into cmexstat-ligne
           move wmajo to cmexstat-ref
DD0351* traitement avoir ou facture
  -        if fcfoa < 4
              move fcmon to cmexstat-mont
           else
              multiply fcmon by -1 giving cmexstat-mont
           end-if
           perform ecrit
           go to lec-lmont-s.

      * fin facture trt port
       fin-fact.
DDE153*    perform trt-port
DDE153*    go to lec-fact.

GPICMT* si demande pour une commande on a fini
DD0279     if wcmex-stat-e1action = ccmex-stat-e1action-cdex            *GPICMT
  -           perform maj-dataware 
  -           go to fin
DD0279     end-if

DD0351* si trt sur dates bornees et date (fcfcd) > date de fin -> fin
  |        if wflag-sk7 = "F" 
  |           perform maj-dataware
  |           go to fin
DD0351      end-if
             
DDE153     perform nnl-fcommaap
DDE153     go to lec-cde.

GPICMT* traitement menusel
DD0350 lec-facture-start.
           initialize wor-ffacture2
           move wcmex-stat-e1jd to fbdfj
           move wcmex-stat-e1md to fbdfm
           move wcmex-stat-e1ad to fbdfa
           perform snlsk2-ffacture
           if file-status not = zero
              go to fin
           end-if
           .
       lec-facture-suite.
           perform nnl-ffacture
           if file-status not = zero
              go to fin
           end-if
           if fbjvt  not = 1
              go to lec-facture-suite
           end-if
      * controle date fin date facture < ou = date fin
           move fbdfj to immti-date-dajour
           move fbdfm to immti-date-damois
           move fbdfa to immti-date-daanne
           move wcmex-stat-e1jf   to immti-date-fajour
           move wcmex-stat-e1mf   to immti-date-famois
           move wcmex-stat-e1af   to immti-date-faanne
           move "<="  to immti-date-trt
           perform ctrl-date
           if ommti-date-rtn not = '0'
              go to fin
           end-if
           initialize wor-fcommaap2
           move fbcle-cdesup to fcnfa-cdesup wfbcle-cdesup
           go to lec-cde-start
           .

       erreur-creat.
DD0316     display 'ECRITURE SEQBIDON INVALID, facture:  ' fbcle-cdesup.
DDE089 err-fin.
DD9999     move 1 to werr
  "        if wcmex-stat-e1periode = "M"
DDE089        display 'Entrer pour continuer'
DDE089        accept wentree
DD9999     end-if
           .
       FIN.
DD0011* en cas d'erreur on envoie un email
DD9999     if werr = 1
DD0279        and wcmex-stat-e1action not = ccmex-stat-e1action-cdex
              move 0 to immut-mail-direct
              move "Verifier log erreur extractio des stats"
                                  to immut-mail-ligne(1)
              move "Programme (cmexsta*) dans log des batch"
                                  to immut-mail-ligne(2)
              move "elgu door micn" to immut-mail-dest
              move spaces to immut-mail-destg
              move spaces to immut-mail-groupe
              move "ERREUR EXTACTION STAT"
                     to immut-mail-objet
              call 'mmut-mail1' using mmut-mail adl-art
           end-if

DD0351*    perform cl-fcommac2.
  -   *    perform cl-fcommac4.
  -   *    perform cl-fcommaap.
  -   *    perform cl-avoircli.
DD0351*    perform cl-ffacture.
GPICMT   if wcmex-stat-e1action not = ccmex-stat-e1action-cdex
           perform cl-seqbidon
         end-if
DD0279*    STOP RUN.
DD0279     exit program.

      *========================================================================
      *                     FONCTIONS LOCALES
      *========================================================================

      * affichage fenetre d'erreur
       ERREUR section.
DD0279   if icmex-stat-direct not = 3
           move wnom-prog to immaf-vali-pgm
           move "V=Validation" to immaf-vali-act
           move "V" to wmmaf-vali-trt
           move "B" to immaf-vali-pos
           move ' ' to wmmaf-vali-trt
           call 'mmaf-vali1' using mmaf-vali adl-art
DD0279   end-if
         .


      * controle date
       ctrl-date section.
DD0279     move "O" to immti-date-zer
           call 'mmti-date2' using mmti-date adl-art
           .

       ctrl-type section.
           move 1 to wi.
       ctrl-type-s.
           if wtype(wi) not = 'n' and not = 'o' and not = 'N' and
                        not = 'O'
              move spaces to wtypex
              go to ctrl-type-f
           end-if
           if wi < 3
              add 1 to wi
              go to ctrl-type-s
           end-if
           .
       ctrl-type-f.


       ctrl-autre section.
           move 2 to wi.
           move '0' to wautre.
       ctrl-autre-s.
           if wtype(wi) = 'o' or = 'O'
              move '1' to wautre
              go to ctrl-autre-f
           end-if
           if wi < 3
              add 1 to wi
              go to ctrl-autre-s
           end-if
           .
       ctrl-autre-f.

      * init enreg a creer
       init-enreg section.
           move spaces to cmexstat
           move ';' to cmexstat-p1 cmexstat-p2 cmexstat-p3 cmexstat-p4
                       cmexstat-p5 cmexstat-p6 cmexstat-p7 cmexstat-p8
                       cmexstat-p9 cmexstat-p10 cmexstat-p11
                       cmexstat-p2-s cmexstat-p5-s cmexstat-p12
                       cmexstat-p13 cmexstat-p14 cmexstat-p15
                       cmexstat-p16 cmexstat-p17 cmexstat-p18
                       cmexstat-p19 cmexstat-p20 cmexstat-p21
                       cmexstat-p22 cmexstat-p23 cmexstat-p24
                       cmexstat-p25 cmexstat-p26 cmexstat-p27
DD0279                 cmexstat-p28 cmexstat-p29 cmexstat-p30
DD0279                 cmexstat-p31 cmexstat-p32
DD0351                 cmexstat-p33 cmexstat-p34 cmexstat-p35
DD0351                 cmexstat-p36 cmexstat-p37 cmexstat-p38
DD0351                 cmexstat-p39 cmexstat-p40 cmexstat-p41
DD9999                 cmexstat-p42 cmexstat-p43 cmexstat-p44
DD9999                 cmexstat-p45

      * on initialise le pcb a 1
DD0351     move 1 to cmexstat-pcb

DD0153*    move fcnfa    to cmexstat-nfac
DD0316     move wfbcle-cdesup    to cmexstat-nfac
DD0316     if wfbcle-cdesup not = zero
              move fbdfa    to cmexstat-data
              move fbdfm    to cmexstat-datm
              move fbdfj    to cmexstat-datj
              move fbtve    to cmexstat-tarif
DD9999*       move fbnrh    to cmexstat-rep
DD0351* date d'echeance
              move fbd1a    to cmexstat-echeancea
              move fbd1m    to cmexstat-echeancem
              move fbd1j    to cmexstat-echeancej
           else
              move fcann    to cmexstat-data
              move fcmoi    to cmexstat-datm
              move fcjou    to cmexstat-datj
              move fctve    to cmexstat-tarif
              move zero     to cmexstat-echeance
DD9999*       move fcrep    to cmexstat-rep
           end-if
DD9999     move fcrep    to cmexstat-rep
           move fcfoa    to cmexstat-foa
GPICMT* JLRO veux differencier les factures de gratuit (saisie en code 8)
GPICMT* comme je ne pouvais changer le code fcfoa (trop utilise) je l'ai laisse a 0 (fact normale)
GPICMT* et j'ai mis l'info dans FCURG qui n'etait pas utilise                    
DD0351     if fcfoa = 0 and fcurg = "1"
              move "8" to cmexstat-foa
           end-if
DD0316     move fccle-cdesup    to cmexstat-ncde
GPICMT* qui saisit la commande
           move FCQSA to cmexstat-quisaisi
           move fcncl    to cmexstat-client
      * prend le lieu expedition
DD9999*    move fcdlr    to cmexstat-depotliv
           move "C"   to immdt-lieu-trt

           move fclli to immdt-lieu-corlieu
           call 'mmdt-lieu1' using wmmdt-lieu adl-art
      * memo lieux expedition pour ctrl gestion client (cas client GPI/ISO/JUZ)
           move lili-lieu to cmexstat-depotliv

           move fctrs    to cmexstat-trp

GPICMT* chargement reference commande du client
DD0279     MOVE fcrefcli  TO cmexstat-refcdecli
  -   * GPIWARNING tant que l'on a pas agrandi la zone ds l'entete de commande
  -   * GPIWARNING on prend la ref commande de fcommac1 pour BRICORAMA
DD0465* on recherche la ref dans fcommac1 pour ts les clients
  -   *    if ocmcd-gest-rtn = cmmdt-envi-rtn-ok
  -   *       if ocmcd-gest-cdepar-grp = "BRM" or = "BTK"               *GPICMT
DD0221*                             or = "PLA" or = "BKD" or = "LAP"    *GPICMT
DD0465*                             or = "CNO" or = "C01"               *GPICMT
DD0221*          perform rech-refcde                                    *GPICMT
  -   *       end-if
DD0279*    end-if

GPICMT* livrea ou plateforme
GPICMT* pays et code postal du lieu de livraison
DD0279     if ocmcd-gest-plateforme not = spaces                        *GPICMT
  -           move ocmcd-gest-plateforme to cmexstat-livrea             *GPICMT
  -           move ocmcd-gest-plateforme-cpostal                        *GPICMT
  -                                to cmexstat-cpostal-livre            *GPICMT
  -           move ocmcd-gest-plateforme-pays to cmexstat-pays-livre    *GPICMT
  -        else                                                         *GPICMT
  -           move ocmcd-gest-livrea to cmexstat-livrea                 *GPICMT
  -           move ocmcd-gest-livrea-cpostal to cmexstat-cpostal-livre  *GPICMT
  -           move ocmcd-gest-livrea-pays to cmexstat-pays-livre        *GPICMT
DD0279     end-if

GPICMT* client final si plateforme ou transitaire
DD0279     if ocmcd-gest-cltfinal not = spaces and not = zero           *GPICMT
             move ocmcd-gest-cltfinal to cmexstat-cltfinal
             move ocmcd-gest-cltfinal-cpostal to cmexstat-cpost-cltfinal
             move ocmcd-gest-cltfinal-lpays to cmexstat-pays-cltfinal
           else
              move spaces to cmexstat-cltfinal
              move spaces to cmexstat-cpost-cltfinal
              move spaces to cmexstat-pays-cltfinal
           end-if

GPICMT* chargement du poids si transport fait GPIWARNING a revoir pour le calculer a la preparation
DD0279     if fcliv = 2                                                 *GPICMT
  -           move fcpoi to cmexstat-poidsnet                           *GPICMT
  -           move fcpbr to cmexstat-poidsbrut                          *GPICMT
DD0279     end-if

DD0351* traitement avoir ou facture
  -        if fcfoa < 4
              move w-fbnmf  to cmexstat-montpf
           else
              multiply w-fbnmf by -1 giving cmexstat-montpf
           end-if
           IF fcfoa = 5 or = 6 or = 7
              move w-info to cmexstat-info
           end-if
DD0153* groupement du commande par
           if ocmcd-gest-rtn = cmmdt-envi-rtn-ok
              move ocmcd-gest-cdepar-grp to cmexstat-grp
           end-if
DD0153* etat de la commande
           if ocmcd-etat-rtn = cmmdt-envi-rtn-ok
              move wcmcd-etat-etat to cmexstat-etat
           end-if
DD0153* date de commande
DD0351*    move fcdcd to cmexstat-datc
  -        move fcann to cmexstat-datca
  -        move fcmoi to cmexstat-datcm
DD0351     move fcjou to cmexstat-datcj
DD0153* delai de livraison
           move fcaa to cmexstat-delaia
           move fcmm to cmexstat-delaim
           move fcjj to cmexstat-delaij
DD0153* date d'expedition
GPICMT* GPIWARNING appel de la fonction cged-aen10 car wor-expmois non faite
GPICMT* GPIWARNING faire fonction cmcd-lectt un fois wor ok
DD0324   move fcnumr-cdesup to cfcnumr
DD0350   move fcninr        to cfcninr
DD0324   move fccle-cdesup  to cfccle
GPICMT   call 'cged-aen10' using cged-avis adl-art
         move tAE-edatelivjo to cmexstat-datej
         move tAE-edatelivmo to cmexstat-datem
         move tAE-edatelivan to cmexstat-datea

GPICMT* infos commande mere si allotie fille
DD0298   if ocgcd-mere-rtn = cmmdt-envi-rtn-ok
  "         move mcae-numcdex to cmexstat-mere
  "         move mcae-refcdecli to  cmexstat-mere-refcdecli
DD0298   end-if

GPICMT* code gestion du livrea saisie entete ou bloc adresse
DD0351   move caladc to cmexstat-gest-livre

GPICMT* type de commande
DD0351   move fcfeo to cmexstat-type-cde

GPICMT* code port
DD0351   move fcfra to cmexstat-cport

GPICMT* code livraison plateforme
DD0351   move fcplateforme to cmexstat-mode-livre

GPICMT* Numero d'expedition
DD0351   string fcnumr-cdesup fcninr
DD0351            delimited size into cmexstat-numexpe

GPICMT* grande classe article
DD0351   move wtgc to cmexstat-classe
           .

       trt-port section.
DDE153*    if FBPOF not = zero and fbfra not = 2
DDE153*       perform init-enreg
DDE153*       move wport to cmexstat-ref
DDE153*       move fbpof to cmexstat-mont
DDE153*       perform ecrit
DDE153*    END-IF

DDE153*    if FBAFF not = zero and fbfra not = 2
DDE153*       perform init-enreg
DDE153*       move waff to cmexstat-ref
DDE153*       move fbaff to cmexstat-mont
DDE153*       perform ecrit
DDE153*    END-IF

DD0351* on n'exclu plus le franco domicile avec du port si avoir
DD0351* car il faut tous les avoirs pour la gestion des litiges
DDE153     IF   (fcmon not = zero  and fcfra not = 2)
DDE153      or ((fcmon not = zero) and (fcfoa = 4 or = 5 or = 6))

               perform init-enreg
DD0153* numero de ligne de commande
DD0153        string fcnel4(2:1) fcunix4
                      delimited size into cmexstat-ligne
DD0351* traitement avoir ou facture
  -           if fcfoa < 4
                 move fcmon to cmexstat-mont
DD0351           move fcmon to wmont-port
              else
                  multiply fcmon by -1 giving cmexstat-mont
DD0351            multiply fcmon by -1 giving wmont-port   
              end-if
              if fcnel4 = 6
                 move wport to cmexstat-ref
              else
                 move waff to cmexstat-ref
              end-if
              perform ecrit
DD0351     END-IF
           .

      * ecriture enregistrement
       ecrit section.
DD0351* pour gpi on remplace la classe 9 (issu du code tarif) par A car la classe 9 article n'existe pas
      * et pose des problemes de controle entre les stats dataware et IRIS
           if mmdt-societe = 'GPI' and cmexstat-classe = '9'
              move 'A' to cmexstat-classe
           end-if
DD0465* idem pour plasto et classe 5
           if mmdt-societe = 'PLASTO'
              and (cmexstat-classe = '5' or cmexstat-classe = '3')
              move '1' to cmexstat-classe
           end-if
           if wprem = '0'
DD0279        and wcmex-stat-e1action not = ccmex-stat-e1action-cdex
              move '1' to wprem
              string 'N.FAC;F; DATE ; N.BL ;CLIENT;REP;  REF  ;SR;'
              'QTE CDEE ;QTE LIV  ; MONTANT ;INFO AVOIR; NET MARCH ;'
              '   LIBELLE DIVERS             ;DP;TR; INFOCOM  ;TAR;GRP'
              ';LIGN;E;DATE C; DELAI;DATE E;NUMF ;NI;S;'
DD0298        'ALL MERE;REF CDE CLIENT MERE ;LIVREA;PDS NET;PDS BRU;REF'
DD0279        ' CDE CLIENT ;PA;CODE POSTAL LIV;GL;ML;T;P;'
DD0351        'N.EXPEDI; PCB  ;QUI '
DD0351        ';ECHEANCE;GC;X'
DD0999        ';FINAL ;C.POST. C.FINAL;PA'
                 delimited size into wor-seqbidon
              perform w-seqbidon
              if file-status not = zero
                 go to erreur-creat
              end-if
           END-IF

      *DDE089 ajout conversion montant dans la devise de base
           perform conv-dev


DD0153*GPICMT recherche des references a ne pas comptabilise dans le CA
DD0153     perform rech-stat

DD0153* numerotation facture a montant zero ou commande a l'etat facture sans
      * facture (cas d'une commande passee par JUZIERS a GPI)
           move cmexstat-nfac to cmexstat-nfacx
           if cmexstat-nfac = zero
              and cmexstat-etat = ccmcd-etat-facture
              perform renumfac
           end-if

DD0351*ajout du montant du port dans le montant pied de facture...au cas ou
  |   *le traitement particulier du port a eu lieu (sinon wmont-port = zero)
  |      move function numval(cmexstat-montpf) to wcmexstat-montpf
  |      add wmont-port                        to wcmexstat-montpf
DD0351   move wcmexstat-montpf                 to cmexstat-montpf

GPICMT* maj dataware d'une commande
DD0279   if wcmex-stat-e1action = ccmex-stat-e1action-cdex              *GPICMT
  -         perform cre-fich
  -      else                                                           *GPICMT
GPICMT* creation dans un fichier sequentiel
           move cmexstat to wor-seqbidon                                *GPICMT
           perform w-seqbidon                                           *GPICMT
           if file-status not = zero
              go to erreur-creat
           end-if
DD0279   end-if
           .

      *
DDE089**** appel fonction conversion des devises pour mettre le montant dans
      *    la devise de base
       conv-dev section.
           move fcdev to weu-adev
           move 99    to weu-ndev
           move cmexstat-mont  to weu-pht
DD0351     perform taux
           call 'mmca-devi1' using wmmca-devi adl-art
           if weu-err = spaces
              move weu-pht to cmexstat-mont
           else
              display weu-err
              GO TO err-fin
           end-if.
           .

DD0153* numerotation facture a montant zero
       renumfac section.
DD0316     move cmexstat-ncde(7:1) to wmmca-alph-pos
           add 11 to wmmca-alph-pos
           move cmmca-alph-trt-i to immca-alph-trt
           call 'mmca-alph1' using mmca-alph adl-art
           string cmexstat-ncde(1:4) wmmca-alph-let
               delimited size into cmexstat-nfacx
GPICMT* les commandes facturees sans numero de facture (montant zero ou interne)
GPICMT* sont passees HORS CA
           move ccmex-stat-stat-non  to cmexstat-stat
           .

DD0153*GPICMT recherche niveau de l'article article/devis ou inconnu
DD0153*GPICMT cas des lignes articles saisie en non references
DD0153 rech-niv section.
GPICMT   IF fcnarx not = spaces
GPICMT      evaluate fctref
GPICMT      when cmmre-nire-type-art
GPICMT         move "01" to cmexstat-niv
GPICMT      when cmmre-nire-type-dev
GPICMT         move "00" to cmexstat-niv
GPICMT      when other
               move spaces to immre-nire-trt wmmre-nire-niv
               move fcnarx to wmmre-nire-ref
               move fcsrex to wmmre-nire-sref
GPICMT         call 'mmre-nire1' using mmre-nire adl-art
GPICMT         evaluate ommre-nire-type
GPICMT         when cmmre-nire-type-art
GPICMT            move "01" to cmexstat-niv
GPICMT         when cmmre-nire-type-artdev
GPICMT            move "01" to cmexstat-niv
GPICMT         when cmmre-nire-type-dev
GPICMT            move "00" to cmexstat-niv
               end-evaluate
            end-evaluate
         END-IF
         .

DD0153*GPICMT recherche des elements HORS CA
DD0153 rech-stat.
GPICMT     move ccmex-stat-stat-ca to cmexstat-stat
GPICMT     evaluate cmexstat-info
GPICMT       when ccmex-stat-av1 
GPICMT            move ccmex-stat-stat-port to cmexstat-stat
GPICMT       when ccmex-stat-av2 
GPICMT            move ccmex-stat-stat-port to cmexstat-stat
GPICMT       when ccmex-stat-av3 
GPICMT            move ccmex-stat-stat-non  to cmexstat-stat
GPICMT       when ccmex-stat-av4 
GPICMT            move ccmex-stat-stat-rfa to cmexstat-stat
GPICMT       when ccmex-stat-av5 
GPICMT            move ccmex-stat-stat-non  to cmexstat-stat
GPICMT       when ccmex-stat-av6 
GPICMT            move ccmex-stat-stat-non  to cmexstat-stat
GPICMT       when ccmex-stat-av7 
GPICMT            move ccmex-stat-stat-rfa  to cmexstat-stat
GPICMT       when ccmex-stat-av8 
GPICMT            move ccmex-stat-stat-non  to cmexstat-stat
GPICMT       when ccmex-stat-av9 
GPICMT            move ccmex-stat-stat-non  to cmexstat-stat
           end-evaluate
GPICMT     evaluate cmexstat-ref
GPICMT       when ccmex-stat-port
GPICMT            move ccmex-stat-stat-port to cmexstat-stat
GPICMT       when ccmex-stat-affranch
GPICMT            move ccmex-stat-stat-port to cmexstat-stat
GPICMT     end-evaluate
GPICMT* pour DINAC on controle d'autre ref
GPICMT     if mmdt-societe = "DINAC"
GPICMT        if cmexstat-ref = ccmex-stat-ref1 or
GPICMT           cmexstat-ref = ccmex-stat-ref2 or
GPICMT           cmexstat-ref = ccmex-stat-ref3 or
GPICMT           cmexstat-ref = ccmex-stat-ref4
GPICMT           move ccmex-stat-stat-non  to cmexstat-stat
              end-if
           end-if

GPICMT* pour OYOBRICO  factures a mettre en code stat RFA
DD0351     if mmdt-societe = "OYOBRICO"                                 *GPICMT
  -           if cmexstat-nfac = "8006805"                              *GPICMT
  -              and cmexstat-datf = "130307"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "8004586"                              *GPICMT
  -              and cmexstat-datf = "120730"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -        end-if

GPICMT* pour PLASTO  factures a mettre en code stat RFA
DD0351     if mmdt-societe = "PLASTO"                                   *GPICMT
  -           if cmexstat-nfac = "7087417"                              *GPICMT
  -              and cmexstat-datf = "130411"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if (cmexstat-nfac = "7080633"                              *GPICMT
  -              or  cmexstat-nfac = "7080630" 
  -              or  cmexstat-nfac = "7080631" 
  -              or  cmexstat-nfac = "7080832") 
  -              and cmexstat-datf = "130208"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if (cmexstat-nfac = "7068160"                             *GPICMT     
  -              or cmexstat-nfac = "7068162")                          *GPICMT     
  -              and cmexstat-datf = "121001"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "7065747"                              *GPICMT
  -              and cmexstat-datf = "120903"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "7063592"                              *GPICMT
  -              and cmexstat-datf = "120803"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "7063200"                              *GPICMT
  -              and cmexstat-datf = "120731"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "7062404"                              *GPICMT
  -              and cmexstat-datf = "120720"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if (cmexstat-nfac = "7060741"                              *GPICMT
  -              or  cmexstat-nfac = "7060742")
  -              and cmexstat-datf = "120704"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if (cmexstat-nfac = "7058848"                              *GPICMT
  -              or  cmexstat-nfac = "7058847")
  -              and cmexstat-datf = "120614"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "7056583"                              *GPICMT
  -              and cmexstat-datf = "120522"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "7056046"                              *GPICMT
  -              and cmexstat-datf = "120515"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if (cmexstat-nfac = "7054039" or                          *GPICMT
  -               cmexstat-nfac = "7054040")                            *GPICMT
  -              and cmexstat-datf = "120419"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if (cmexstat-nfac = "7052901")                            *GPICMT
  -              and cmexstat-datf = "120406"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if (cmexstat-nfac = "7052654")                            *GPICMT
  -              and cmexstat-datf = "120404"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if (cmexstat-nfac = "7049816")                            *GPICMT
  -              and cmexstat-datf = "120306"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if (cmexstat-nfac = "7050553"  or                         *GPICMT
  -              cmexstat-nfac = "7050552")                             *GPICMT
  -              and cmexstat-datf = "120313"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if (cmexstat-nfac = "7050550")                             *GPICMT
  -              and cmexstat-datf = "120313"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if (cmexstat-nfac = "7049677"  or                         *GPICMT
  -              cmexstat-nfac = "7049678")                             *GPICMT
  -              and cmexstat-datf = "120305"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if (cmexstat-nfac = "7049312")                             *GPICMT
  -              and cmexstat-datf = "120229"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if (cmexstat-nfac = "7046950"  or                         *GPICMT
  -              cmexstat-nfac = "7046953")                             *GPICMT
  -              and cmexstat-datf = "120203"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "7041896"                              *GPICMT
  -              and cmexstat-datf = "111206"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "7041894"                              *GPICMT
  -              and cmexstat-datf = "111206"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "7039315"                              *GPICMT
  -              and cmexstat-datf = "111107"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "7039312"                              *GPICMT
  -              and cmexstat-datf = "111107"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "7039311"                              *GPICMT
  -              and cmexstat-datf = "111107"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "7039309"                              *GPICMT
  -              and cmexstat-datf = "111107"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "7033794"                              *GPICMT
  -              and cmexstat-datf = "110908"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "7028102"                              *GPICMT
  -              and cmexstat-datf = "110706"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "7027421"                              *GPICMT
  -              and cmexstat-datf = "110628"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "7017294"                              *GPICMT
  -              and cmexstat-datf = "110308"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if (cmexstat-nfac = "7011405" or = "7011407"              *GPICMT
  -                          or = "7011409")                            *GPICMT
  -              and cmexstat-datf = "101229"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "7010381"                              *GPICMT
  -              and cmexstat-datf = "101217"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "7016137"                              *GPICMT
  -              and cmexstat-datf = "110222"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if (cmexstat-nfac = "7016289" or = "7016290"              *GPICMT
  -                          or = "7016291" or = "7016292")             *GPICMT
  -              and cmexstat-datf = "110224"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "7016501"                              *GPICMT
  -              and cmexstat-datf = "110228"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
DD0351     end-if

GPICMT* pour GPI 2 factures d'annulation de RFA doivent etre tester car rien de prevu
GPICMT* dans l'appli pour les trouver et ne pas les passer en stat ==> a partir de 2007
GPICMT* il faudra creer une reference article speciale pour ce cas
  -           if (cmexstat-nfac = "1595143" or                           *GPICMT
  -              cmexstat-nfac = "1595145")                             *GPICMT
  -              and cmexstat-datf = "130305"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if (cmexstat-nfac = "1591539" or                           *GPICMT
  -              cmexstat-nfac = "1591538")                             *GPICMT
  -              and cmexstat-datf = "130211"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if (cmexstat-nfac = "1591940" or                           *GPICMT
  -              cmexstat-nfac = "1591941" or                           *GPICMT
  -              cmexstat-nfac = "1591942")                             *GPICMT
  -              and cmexstat-datf = "130212"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
DD0351     if mmdt-societe = "GPI"                                      *GPICMT
DD0351        if cmexstat-nfac = "1585006"
  -              and cmexstat-datf = "130103"                           *GPICMT
                 move ccmex-stat-stat-rfa  to cmexstat-stat
              end-if
  -           if cmexstat-nfac = "1583856"                              *GPICMT
  -              and cmexstat-datf = "121221"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "1578425" or                           *GPICMT
  -              cmexstat-nfac = "1578426" or                           *GPICMT
  -              cmexstat-nfac = "1578427" or                           *GPICMT
  -              cmexstat-nfac = "1578428" or                           *GPICMT
  -              cmexstat-nfac = "1578429" or                           *GPICMT
  -              cmexstat-nfac = "1578430" or                           *GPICMT
  -              cmexstat-nfac = "1578431" or                           *GPICMT
  -              cmexstat-nfac = "1578432" or                           *GPICMT
  -              cmexstat-nfac = "1578433"                              *GPICMT
  -              and cmexstat-datf = "121121"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "1573161"                              *GPICMT
  -              and cmexstat-datf = "121023"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "1568660"                              *GPICMT
  -              and cmexstat-datf = "120927"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "1568396" or                           *GPICMT
  -              cmexstat-nfac = "1568397" or                           *GPICMT
  -              cmexstat-nfac = "1568398"                              *GPICMT
  -              and cmexstat-datf = "120926"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "1554664"                              *GPICMT
  -              and cmexstat-datf = "120710"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "1557609"                              *GPICMT
  -              and cmexstat-datf = "120727"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "1550309"                              *GPICMT
  -              and cmexstat-datf = "120614"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "1549978"                              *GPICMT
  -              and cmexstat-datf = "120613"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if (cmexstat-nfac = "1542316" or                          *GPICMT
                 cmexstat-nfac = "1542317")                             *GPICMT
  -              and cmexstat-datf = "120502"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if (cmexstat-nfac = "1544688" or                          *GPICMT
                 cmexstat-nfac = "1544689")                             *GPICMT
  -              and cmexstat-datf = "120515"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if (cmexstat-nfac = "1547715" or                          *GPICMT
                 cmexstat-nfac = "1547716")                             *GPICMT
  -              and cmexstat-datf = "120601"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "1537042"                              *GPICMT
  -              and cmexstat-datf = "120402"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "1527105"                              *GPICMT
  -              and cmexstat-datf = "120207"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "1526911"                              *GPICMT
  -              and cmexstat-datf = "120206"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "1503695" or = "1503696"               *GPICMT
  -              and cmexstat-datf = "110928"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "1488679"                              *GPICMT
  -              and cmexstat-datf = "110719"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "1487698" or = "1487699"               *GPICMT
  -              and cmexstat-datf = "110712"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "1481288"                              *GPICMT
  -              and cmexstat-datf = "110615"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if (cmexstat-nfac = "1464437" or = "1464438"              *GPICMT
  -                          or = "1464439" or = "1464440")
  -              and cmexstat-datf = "110317"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "1460663" or = "1460621"               *GPICMT
  -              and cmexstat-datf = "110301"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "1463778"                              *GPICMT
  -              and cmexstat-datf = "110315"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "1002713"                              *GPICMT
  -              and cmexstat-datf = "060120"                           *GPICMT
  -              move ccmex-stat-stat-non  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "1002714"                              *GPICMT
  -              and cmexstat-datf = "060120"                           *GPICMT
  -              move ccmex-stat-stat-non  to cmexstat-stat             *GPICMT
  -           end-if
GPICMT* elgu le 15/10/2009 pour CORA suite transfert de ERELS dans GPI ==> 3 factures de regul de RFA
  -           if cmexstat-nfac = "1359327"                              *GPICMT
  -              and cmexstat-datf = "090904"                           *GPICMT
  -              move ccmex-stat-stat-rfa to cmexstat-stat              *GPICMT
  -           end-if
  -           if cmexstat-nfac = "1359328"                              *GPICMT
  -              and cmexstat-datf = "090904"                           *GPICMT
  -              move ccmex-stat-stat-rfa to cmexstat-stat              *GPICMT
  -           end-if
  -           if cmexstat-nfac = "1359575"                              *GPICMT
  -              and cmexstat-datf = "090907"                           *GPICMT
  -              move ccmex-stat-stat-rfa to cmexstat-stat              *GPICMT
  -           end-if
GPICMT* elgu le 09/03/2010 pour CORA suite trop verse pour compte RFA ==> 2 factures de regul de RFA
  -           if cmexstat-nfac = "1393178"                              *GPICMT
  -              and cmexstat-datf = "100305"                           *GPICMT
  -              move ccmex-stat-stat-rfa to cmexstat-stat              *GPICMT
  -           end-if
  -           if cmexstat-nfac = "1393179"                              *GPICMT
  -              and cmexstat-datf = "100305"                           *GPICMT
  -              move ccmex-stat-stat-rfa to cmexstat-stat              *GPICMT
  -           end-if
GPICMT* elgu avril 2010 3 factures pour annuler des RFA
  -           if (cmexstat-nfac = "1400865" or = "1400867"              *GPICMT
  -                          or = "1400990")                            *GPICMT
  -               and cmexstat-datf = "100419"                          *GPICMT
  -               move ccmex-stat-stat-rfa to cmexstat-stat             *GPICMT
  -           end-if
GPICMT* elgu le 15/10/09 suite a erreur de facturation fin de mois fevrier de GPI ==> DINAC
GPICMT*                  des avoirs et factures ont ete refaits, je les remets dans las bons mois
DD0351        if cmexstat-nfac = "1365457"                              *GPICMT
  -              and cmexstat-datf = "091006"                           *GPICMT
  -              move 090227 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
  -           if cmexstat-nfac = "1365434"                              *GPICMT
  -              and cmexstat-datf = "091006"                           *GPICMT
  -              move 090227 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
  -           if cmexstat-nfac = "1365433"                              *GPICMT
  -              and cmexstat-datf = "091006"                           *GPICMT
  -              move 090227 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
  -           if cmexstat-nfac = "1365459"                              *GPICMT
  -              and cmexstat-datf = "091006"                           *GPICMT
  -              move 090227 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
GPICMT* suite a bud cglpfact1 ne pas passer la facture 1301986 en stat
DD0351        if cmexstat-nfac = "1301986"                              *GPICMT
  -              and cmexstat-datf = "080929"                           *GPICMT
  -              move ccmex-stat-stat-non  to cmexstat-stat             *GPICMT
DD0351        end-if
GPICMT* facture reelle decembre 2007
DD0394        if cmexstat-nfac = "1265293"                              *GPICMT
  -              and cmexstat-datf = "080303"                           *GPICMT
  -              move 071228 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
GPICMT* avoir annulant facture decembre 2007 1255335
  -           if cmexstat-nfac = "1265294"                              *GPICMT
  -              and cmexstat-datf = "080303"                           *GPICMT
  -              move 071228 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
GPICMT* avoir annulant fa facture de janvier 2008 1260421
  -           if cmexstat-nfac = "1266100"                              *GPICMT
  -              and cmexstat-datf = "080306"                           *GPICMT
  -              move 080131 TO cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
GPICMT* facture reelle janvier 2008
  -           if cmexstat-nfac = "1266098"                              *GPICMT
  -              and cmexstat-datf = "080306"                           *GPICMT
  -              move 080131 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
GPICMT* facture reelle fevirier 2008
  -           if cmexstat-nfac = "1266099"                              *GPICMT
  -              and cmexstat-datf = "080306"                           *GPICMT
  -              move 080229 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
GPICMT* avoir GPI==>DINAC relle decembre 2007
  -           if cmexstat-nfac = "1268514"                              *GPICMT
  -              and cmexstat-datf = "080320"                           *GPICMT
  -              move 071231 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
GPICMT* annulation des factures de janvier a juillet pour erels par des avoirs
GPICMT* et nouvelles factures
GPICMT* avoir janvier 2008
  -           if cmexstat-nfac = "1295119"                              *GPICMT
  -              and cmexstat-datf = "080822"                           *GPICMT
  -              move 080131 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
GPICMT* avoir fevrier 2008
  -           if cmexstat-nfac = "1295120"                              *GPICMT
  -              and cmexstat-datf = "080822"                           *GPICMT
  -              move 080229 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
GPICMT* avoir mars 2008
  -           if cmexstat-nfac = "1295121"                              *GPICMT
  -              and cmexstat-datf = "080822"                           *GPICMT
  -              move 080331 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
GPICMT* avoir avril 2008
  -           if cmexstat-nfac = "1295122"                              *GPICMT
  -              and cmexstat-datf = "080822"                           *GPICMT
  -              move 080430 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
GPICMT* avoir mai 2008
  -           if cmexstat-nfac = "1295123"                              *GPICMT
  -              and cmexstat-datf = "080822"                           *GPICMT
  -              move 080531 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
GPICMT* avoir juin 2008
  -           if cmexstat-nfac = "1295124"                              *GPICMT
  -              and cmexstat-datf = "080822"                           *GPICMT
  -              move 080630 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
GPICMT* avoir juillet 2008
  -           if cmexstat-nfac = "1295125"                              *GPICMT
  -              and cmexstat-datf = "080822"                           *GPICMT
  -              move 080731 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
GPICMT* facture janvier 2008
  -           if cmexstat-nfac = "1295126"                              *GPICMT
  -              and cmexstat-datf = "080822"                           *GPICMT
  -              move 080131 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
GPICMT* facture fevrier 2008
  -           if cmexstat-nfac = "1295127"                              *GPICMT
  -              and cmexstat-datf = "080822"                           *GPICMT
  -              move 080229 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
GPICMT* facture mars 2008
  -           if cmexstat-nfac = "1295128"                              *GPICMT
  -              and cmexstat-datf = "080822"                           *GPICMT
  -              move 080331 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
GPICMT* facture avril 2008
  -           if cmexstat-nfac = "1295129"                              *GPICMT
  -              and cmexstat-datf = "080822"                           *GPICMT
  -              move 080430 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
GPICMT* facture mai 2008
  -           if cmexstat-nfac = "1295130"                              *GPICMT
  -              and cmexstat-datf = "080822"                           *GPICMT
  -              move 080531 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
GPICMT* facture juin 2008
  -           if cmexstat-nfac = "1295131"                              *GPICMT
  -              and cmexstat-datf = "080822"                           *GPICMT
  -              move 080630 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
GPICMT* facture juillet 2008
  -           if cmexstat-nfac = "1295132"                              *GPICMT
  -              and cmexstat-datf = "080822"                           *GPICMT
  -              move 080731 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
GPICMT* avoir octobre 2008
  -           if cmexstat-nfac = "1313180"                              *GPICMT
  -              and cmexstat-datf = "081202"                           *GPICMT
  -              move 081031 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
GPICMT* facture octobre 2008
  -           if cmexstat-nfac = "1313155"                              *GPICMT
  -              and cmexstat-datf = "081202"                           *GPICMT
  -              move 081031 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
GPICMT* avoir novembre 2008
  -           if cmexstat-nfac = "1313181"                              *GPICMT
  -              and cmexstat-datf = "081202"                           *GPICMT
  -              move 081130 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
GPICMT* facture novembre 2008
  -           if cmexstat-nfac = "1313156"                              *GPICMT
  -              and cmexstat-datf = "081202"                           *GPICMT
  -              move 081130 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
GPICMT* avoir fevrier 2010 pour DELOS et NESPOLI sur stat en 2009
  -           if (cmexstat-nfac = "1388590" or = '1388591'              *GPICMT
  -                          or = '1388593'                             *GPICMT
  -                          or = '1388594' or = '1388596'              *GPICMT
  -                          or = '1388597')                            *GPICMT
  -              and cmexstat-datf = "100210"                           *GPICMT
  -              move 091231 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
GPICMT* annulation d'un avoir de RFA par une facture
  -           if cmexstat-nfac = "1445006" and cmexstat-datf = "101207" *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
DD0351     end-if
DD0351     if mmdt-societe = "DINAC"                                    *GPICMT
  -           if cmexstat-nfac = "2525728"                              *GPICMT
                 and cmexstat-datf = "130220"
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "2449023"                              *GPICMT
                 and cmexstat-datf = "120302"
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if (cmexstat-nfac = "2455166" or                          *GPICMT
                  cmexstat-nfac = "2455165" or                          *GPICMT
                  cmexstat-nfac = "2455164")                            *GPICMT
  -              and cmexstat-datf = "120327"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -           if cmexstat-nfac = "2459013"                              *GPICMT
  -              and cmexstat-datf = "120413"                           *GPICMT
  -              move ccmex-stat-stat-rfa  to cmexstat-stat             *GPICMT
  -           end-if
  -        end-if

GPICMT* pour SLOVAQUIE des commandes livrees en 2008 n'ont pas ete facturees ==> facturees sur decembre 2008
GPICMT* je les remets dans les bon mois pour les stats
DD0351     if mmdt-societe = "SLOVAQ"                                   *GPICMT
  -           if cmexstat-nfac = "6000822"                              *GPICMT
  -              and cmexstat-datf = "081229"                           *GPICMT
  -              move 080717 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
  -           if cmexstat-nfac = "6000823"                              *GPICMT
  -              and cmexstat-datf = "081229"                           *GPICMT
  -              move 080328 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
  -           if cmexstat-nfac = "6000825"                              *GPICMT
  -              and cmexstat-datf = "081229"                           *GPICMT
  -              move 080505 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
  -           if cmexstat-nfac = "6000826"                              *GPICMT
  -              and cmexstat-datf = "081229"                           *GPICMT
  -              move 080415 to cmexstat-datf cmexstat-datc             *GPICMT
  -                             cmexstat-delai cmexstat-date            *GPICMT
  -           end-if
DD0351     end-if
           .

DD0279* recherche reference commande dans fichier commentaire
       rech-refcde section.
           move fccle-cdesup  to pfjcle1
           perform r-fcommac1.
           if file-status = zero
              move pfjli2 to wlentb
              if wlab = "COMMANDE CLIENT:  "
                 move wlbb to cmexstat-refcdecli
              end-if
           end-if
           .

GPICMT* si traitement avec facture on passe le taux de la devise
GPICMT* sinon le taux sera pris en parametre
       taux section.
DD0351     if fcnfa-cdesup not = zero
  "           move fbtch to weu-coef
  "           move cweu-trt-coef to weu-trt
  "        else
  "           move fcdev to weu-adev
  "           move spaces to weu-trt
DD0351     end-if
           .

DD0279* creation ligne stat pour maj dataware
       cre-fich section.
GPICMT   move cmexstat to immpa-fich-ligne
         move 'E'    to immpa-fich-trt
         move 130    to immpa-fich-taille
         call 'mmpa-fich1' using mmpa-fich adl-art
         .

DD0279* appel maj de la dataware
       maj-dataware section.

         string 'ADLPID' x'00' delimited by size into var-name
         move space to var-data
         call 'genvcc' using var-name var-data
         move var-data to wadlpid

DD0351   string 'GPITHRACINE' x'00' delimited by size
              into var-name
         move space to var-data
         call 'genvcc' using var-name var-data
         move var-data to wgpitmp

      * copie du fichier dans tmp
         string 'mv ' ommpa-fich-nom ' ' delimited by size
DD0351              wgpitmp '/dataware/INTCD-' fccle-cdesup '-' wadlpid
                    delimited space '.txt'  " >/dev/null 2>&1"
                      X'00'delimited
                      by size into sys-var
         call "systcc" using sys-var syst-rtn
         move space to var-data

         string 'GPIPROC' x'00' delimited by size
                into var-name
         move space to var-data
         call 'genvcc' using var-name var-data

         string var-data delimited by " " "/cmcdware_maj.sh "
                 delimited by size
                 wgpitmp '/dataware/INTCD-' fccle-cdesup '-' wadlpid
                    delimited space '.txt'
                       " >/dev/null 2>&1" X'00'
              delimited by size into sys-var
         call "systcc" using sys-var syst-rtn
         .

       pro section.
DD0279     copy "../copy/pro-fcommac1".
           copy "../copy/pro-fcommac2".
           copy "../copy/pro-fcommac4".
           copy "../copy/pro-fcommaap".
           copy "../copy/pro-ffacture".
           copy "../copy/pro-seqbidon".
           copy "../copy/pro-avoircli".
